Revit 2027 API
IFCExternalServiceUIData.SelectedIFCItem Property
 The selected IFC Item (can be IFC Entity, or PredefinedType)
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SelectedIFCItem { get; set; }
Public Property SelectedIFCItem As String
	Get
	Set
public:
property String^ SelectedIFCItem {
	String^ get ();
	void set (String^ value);
}
member SelectedIFCItem : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace